""" Задача 2: Обратная строка

Попроси пользователя ввести слово, а программа должна вывести его в обратном порядке. """

user_word = input('Введите слова для шифровки: ')
print(f'Зашифровано: {user_word[::-1]}')