""" Задача 5: Угадай число

Компьютер "задумал" число от 1 до 10, пользователь должен угадать.
Если не угадал — выводим подсказку: больше или меньше.
Когда угадает — поздравление и выход.

Подсказка: нужно random.randint(1, 10) и цикл while. """

import random

target_number = random.randint(1, 10)

while True:
    user_number = int(input(f'Угадайте число, загаданное компьютером! Ваше число?: '))
    if user_number == target_number:
        print(f'Верно! Это число: {target_number} ! Какой молодец!')
        break
    else:
        print(f'Неверно! Попробуй еще.')
        continue
    
    
""" его пометки
Всё чётко и логично!
Можно добавить подсказки, чтобы игра стала чуть «умнее»:

import random

target = random.randint(1, 10)
while True:
    guess = int(input("Угадай число от 1 до 10: "))
    if guess == target:
        print("🎉 Верно! Молодец!")
        break
    elif guess < target:
        print("Моё число больше.")
    else:
        print("Моё число меньше.") """