# Задача 1 — Булевы проверки

# Пользователь вводит число.

# Если число > 0 → вывести Положительное

# Если число < 0 → вывести Отрицательное

# Если число = 0 → вывести Ноль

# Используй тип bool для логики условий.


x = int(input('Введите число: '))
if x > 0: print('Положительное')
if x < 0: print('Отрицательное')
if x == 0: print('Ноль')
