# Задача 2 — Подсчёт слов

# Пользователь вводит предложение.
# Нужно вывести:

# количество слов,

# самое длинное слово,

# среднюю длину слова.

# (Подсказка: используй .split() и len())

user_sentesens = 'шел артем по городу и попал в капкан'

user_list = user_sentesens.split()
user_list.sort(key=len)
count_letter = 0

for x in user_list:
    count_letter += len(x)

print(count_letter)
print(f'Количество слов в предложении: {len(user_list)}, самое длинное слово: {user_list[-1]}, средняя длина слова: {count_letter//len(user_list)}')

# 💡 Можно чуть упростить с помощью sum():

# avg_len = sum(len(x) for x in user_list) / len(user_list)


# и округлить до 1–2 знаков при желании.