# Задача 5 — Частота символов

# Пользователь вводит строку.
# Программа должна вывести, сколько раз встречается каждый символ (в любом порядке).
# (Подсказка: можно использовать for и словарь, либо count())

user_str = 'шел антон по полю и нашел цветы'
word_list = []
i = 0
y = ''

for x in user_str:
    if x not in word_list:
        word_list.append(x)
        word_list.append(user_str.count(x))
 
          
for x in word_list:
    if i == 0:
        y = x
        i += 1
    elif i == 1:
        print(f'{y} : {x}')
        i -= 1

# ⚠️ Работает, но громоздко. Есть проще и безопаснее:

# user_str = 'шел антон по полю и нашел цветы'
# char_count = {}

# for ch in user_str:
#     char_count[ch] = char_count.get(ch, 0) + 1

# for k, v in char_count.items():
#     print(f'{k}: {v}')


# 💡 или вообще в одну строку через collections.Counter:

# from collections import Counter
# print(Counter(user_str))